# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..Append Method
ExternalApplicationArray Class See Also
---
Add the item to the end of the array.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	IExternalApplication item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As IExternalApplication _
)
```

Visual C++
---
```text
public:
virtual void Append(
	IExternalApplication^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.UI..::..IExternalApplicationThe item to be added.
# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace